{
  "Aritmética": {
    "Simplificar": {
      "operacion": "Simplify",
      "codigo": "simplify/",
      "descripcion": "La simplificación es el proceso de hacer una expresión matemática más sencilla sin cambiar su valor. En newton, simplify/ se puede utilizar principalmente para hacer cálculos aritméticos básicos como sumas restas o multiplicaciones. Por ejemplo simplify/2^2+2(2) nos devolverá 8.",
      "imagen": "./img/"
    },
    "Factorizar": {
      "operacion": "Factor",
      "codigo": "factor/",
      "descripcion": "La factorización es el proceso de escribir una expresión matemática como un producto de factores. En newton basta con introducir la expresión a simplifar luego de introducir la operación 'factor'. Por ejemplo factor/x^2 + 2x = x (x + 2) ",
      "imagen": ""
    },
    "Valor Absoluto": {
      "operacion": "Absolute Value",
      "codigo": "abs/",
      "descripcion": "El valor absoluto de un número es su magnitud sin tener en cuenta su signo. Por ejemplo, introducir abs/-1 nos devuelve 1.",
      "imagen": ""
    },
    "Fracción": {
      "operacion": "Fraction",
      "codigo": "(over)",
      "descripcion": "Para computar fracciones en newton, debemos escribirlas de esta forma numerador(sobre)denominador. Por ejemplo, para procesar 2/4 debe enviar su expresión como 2(over)4. La expresión resultante estará en notación matemática estándar (1/2, 3/4).",
      "imagen": ""
    }
  },
  "Análisis matemático": {
    "Derivada": {
      "operacion": "Derive",
      "codigo": "derive/",
      "descripcion": "La derivada es una medida de cómo cambia una función en un punto dado. Se representa mediante la notación dy/dx, y se puede calcular utilizando reglas y fórmulas específicas.",
      "imagen": ""
    },
    "Integral": {
      "operacion": "Integrate",
      "codigo": "integrate/",
      "descripcion": "La integral en matemáticas es el área bajo la curva de una función en un intervalo dado. Se representa mediante la notación ∫, y se puede calcular utilizando reglas y fórmulas específicas.",
      "imagen": ""
    },
    "Raíces": {
      "operacion": "Find 0's",
      "codigo": "zeroes/",
      "descripcion": "También llamadas raíces, son los valores de x para los cuales una función es igual a cero. Por ejemplo zeroes/x^2+2x nos devuelve -2,0.",
      "imagen":""
    },"Área bajo la curva": {
      "operacion": "Area Under Curve",
      "codigo": "area/",
      "descripcion": "El área bajo la curva de una función en un intervalo dado se refiere al área comprendida entre la curva de la función y el eje x en ese intervalo. En newton se introducirá con el formato c:d|f(x) donde c es el valor x inicial, d es el valor x final, y f(x) es la función bajo la cual se quiere la curva entre los dos valores x.",
      "imagen": ""
    },
    "Logaritmo": {
      "operacion": "Logarithm",
      "codigo": "log/",
      "descripcion": "El logaritmo es una medida de la potencia a la que se debe elevar una base para obtener un determinado número. En newton se utiliza la notación log/x|b donde x es el numero y b la base sobre la que calcular el logaritmo, separados por un signo de pipe (|).",
      "imagen": ""
    }
  },
  "Trigonometría": {
    "Coseno": {
      "operacion": "Cosine",
      "codigo": "cos/",
      "descripcion": "El coseno es una función matemática que describe la relación entre los catetos y la hipotenusa de un triángulo rectángulo. Se puede calcular utilizando reglas y fórmulas específicas.",
      "imagen": ""
    },
    "Seno": {
      "operacion": "Sine",
      "codigo": "sin/",
      "descripcion": "El seno es una función matemática que describe la relación entre los catetos y la hipotenusa de un triángulo rectángulo. Se puede calcular utilizando reglas y fórmulas específicas.",
      "imagen": ""
    },
    "Tangente": {
      "operacion": "Tangent",
      "codigo": "tan/",
      "descripcion": "La tangente es una función matemática que describe la relación entre los catetos y la hipotenusa de un triángulo rectángulo. Para encontrar la recta tangente de una función en un determinado valor x, envíe la petición como c|f(x) donde c es el valor x dado y f(x) es la expresión de la función, el separador es una barra vertical '|'.",
      "imagen": ""
    },
    "Arcocoseno": {
      "operacion": "Inverse Cosine",
      "codigo": "arccos/",
      "descripcion": "El arcocoseno es la función inversa del coseno. Devuelve el ángulo cuya función coseno es el valor dado.",
      "imagen": ""
    },
    "Arcoseno": {
      "operacion": "Inverse Sine",
      "codigo": "arcsin/",
      "descripcion": "El arcoseno es la función inversa del seno. Devuelve el ángulo cuya función seno es el valor dado.",
      "imagen": ""
    },
    "Arcotangente": {
      "operacion": "Inverse Tangent",
      "codigo": "arctan/",
      "descripcion": "La arcotangente es la función inversa de la tangente. Devuelve el ángulo cuya función tangente es el valor dado.",
      "imagen": ""
    }
  },
  "Constantes matemáticas": {
    "Número de Euler": {
      "operacion": "e",
      "codigo": "",
      "descripcion": "El número de Euler, también conocido como la constante de Euler, es un número irracional aproximadamente igual a 2.71828. Es importante en matemáticas, especialmente en cálculo y en la teoría de números",
      "imagen": ""
    },
    "Número Pi": {
      "operacion": "pi",
      "codigo": "/pi",
      "descripcion": "Pi, es un número irracional, es una constante matemática, la relación entre la circunferencia de un círculo y su diámetro, es aproximadamente igual a 3.14159",
      "imagen": ""
    }
  }
}
